app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "code", "title", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["content", "qqqqqqqq"], ["user_id", 1], ["created_at", "2019-05-11 16:15:41.629148"], ["updated_at", "2019-05-11 16:15:41.629148"], ["code", "qqqqq"], ["title", "qq"], ["category_id", 1]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save!

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 15]]
---
  def destroy
      @micropost = Micropost.find(params[:id])
      @micropost.destroy!

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @micropost = Micropost.find(params[:id])
    @category = Category.find(@micropost.category_id)