app/controllers/static_pages_controller.rb

SELECT  1 AS one FROM "microposts" LIMIT ?  [["LIMIT", 1]]
---
  def home
    # @micropost  = current_user.microposts.build
    # @feed_items = current_user.feed.paginate(page: params[:page])
    puts "** home **"
    @microposts = Micropost.all
    if @microposts.any?