app/controllers/users_controller.rb

  def index
      # @users = User.all
      @users = User.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"