app/controllers/word_controller.rb

  def home
    puts '** home ***'
    @words = Word.all
---
SELECT "words".* FROM "words"