app/controllers/word_controller.rb

SELECT DISTINCT "words".* FROM "words" ORDER BY "words"."check" ASC, "words"."created_at" DESC
---
  def home
    puts '** home ***'
    @q = Word.ransack(params[:q])
    @words = @q.result(distinct: true).order(check: "ASC").order(created_at: "DESC")

INSERT INTO "words" ("key", "created_at", "updated_at") VALUES (?, ?, ?)  [["key", "ss"], ["created_at", "2019-05-17 14:06:32.121431"], ["updated_at", "2019-05-17 14:06:32.121431"]]
---
  def create
    puts '***** create *****'
    #一括登録（改行が区切り）
    tmp = params[:word][:key].split("\r\n")
    tmp.each do |f|
      @words = Word.new(key: f)
      @words.save

SELECT  "words"."key" FROM "words" ORDER BY "words"."created_at" DESC LIMIT ?  [["LIMIT", 10]]
---
  def study
    puts 'search --------------'
    # #検索結果が得られない。。（保留中 2019/5/29
    # @q = Word.ransack(params[:q])
    # @words = @q.result(distinct: true)
    @words = Word.limit(10).order(check: "ASC")
    @keys = @words.pluck(:key)

SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "words" SET "check" = ?, "updated_at" = ? WHERE "words"."id" = ?  [["check", 1], ["updated_at", "2019-05-27 12:56:31.827839"], ["id", 1162]]
---
  def upd_add
    @word = Word.find(params[:id])
    @word[:check] = @word[:check].to_i + 1
    @word.save

SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "words" SET "check" = ?, "updated_at" = ? WHERE "words"."id" = ?  [["check", 4], ["updated_at", "2019-05-27 13:15:43.966711"], ["id", 1162]]
---
  def upd_mns

    @word = Word.find(params[:id])
    @word[:check] = @word[:check].to_i - 1
    @word.save

SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    @word = Word.find(params[:id])

SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "words" WHERE "words"."id" = ?  [["id", 5]]
---
  def destroy
    @word = Word.find(params[:id])
    @word.destroy

DELETE FROM "words" WHERE "words"."id" = ?  [["id", 51]]
---
  def del_all
    Word.destroy_all